import React from "react";

function AboutPage() {
  return (
    <>
      <h2>Обо мне</h2>
      <img src="" alt="Фото из школы" />
      <h3>Моя история</h3>
      <p>
        Меня заинтересовало программирование еще во время школьных занятий
        информатикой. Я прошел курсы по основам программирования и участвовал в
        небольших олимпиадах, что помогло мне получить первоначальные знания в
        этой области. Однако, после окончания школы я пошел на другую
        специальность и начал откладывать программирование на второй план. Все
        же я продолжал следить за событиями в мире IT и интересоваться новыми
        технологиями и продуктами. В университете я начал заниматься фрилансом в
        качестве веб-разработчика, используя различные конструкторы сайтов.
        Однако, позже осознал, что моих знаний недостаточно для создания
        высококачественных сайтов. Тогда я решил начать изучение языков
        программирования с самых основ, таких как HTML, CSS и JavaScript. Я
        уделял каждый день на протяжении года изучению новых технологий и
        созданию сайтов, и это привело меня к тому, что я начал искать работу в
        сфере IT. У меня получилось найти работу фронтенд-разработчика, где я
        смог принять участие в создании проектов уже с пременением React и
        TypeScript. Я продолжаю учиться и изучать новые технологии, чтобы
        применять их на практике и добиваться еще больших успехов в своей сфере.
        После всех этих годов программирование стало моим любимым делом, и я не
        могу представить себя не занимающимся этой увлекательной профессией.
      </p>
    </>
  );
}



export default AboutPage;